2019/java-enhancements.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-11 周一 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java SE 5.0 - SE 8 的功能增强</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java SE 5.0 - SE 8 的功能增强</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa8bd7c">1. 前言</a></li>
<li><a href="#org3b40f0f">2. Java 5.0</a>
<ul>
<li><a href="#org85321c5">2.1. Generics</a></li>
<li><a href="#org7f4153a">2.2. Enhanced for Loop</a></li>
<li><a href="#orgae76752">2.3. Autoboxing</a></li>
<li><a href="#orgca9f7d3">2.4. Typesafe Enums</a></li>
<li><a href="#org2c659ac">2.5. Varargs</a></li>
<li><a href="#orgcfee02d">2.6. Static Import</a></li>
<li><a href="#org9102728">2.7. Annotations</a></li>
</ul>
</li>
<li><a href="#orgeece46a">3. Java SE 6</a></li>
<li><a href="#org5243bd8">4. Java SE 7</a>
<ul>
<li><a href="#org0fda5c2">4.1. Binary Literals</a></li>
<li><a href="#org7e77784">4.2. Underscores in Numeric Literals</a></li>
<li><a href="#org8cc4d69">4.3. Strings in switch Statements</a></li>
<li><a href="#orgc385196">4.4. Type Inference for Generic Instance Creation</a></li>
<li><a href="#org7f2900a">4.5. The try-with-resources Statement</a></li>
<li><a href="#org9880b36">4.6. Catching Multiple Exception Types and Rethrowing Exceptions with Improved Type Checking</a></li>
</ul>
</li>
<li><a href="#orgc63e546">5. Java SE 8</a>
<ul>
<li><a href="#org5ef3022">5.1. Lambda Expressions</a></li>
<li><a href="#org1ebd622">5.2. Improved Type Inference</a></li>
<li><a href="#orgab86300">5.3. Annotations on Java Types</a></li>
<li><a href="#orgc1680fe">5.4. Repeating Annotations</a></li>
<li><a href="#orgfdb6495">5.5. Method Parameter Reflection</a></li>
</ul>
</li>
<li><a href="#org99cdd23">6. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa8bd7c" class="outline-2">
<h2 id="orgfa8bd7c"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在学习 <b>Python</b> 的过程中就因为不同版本之间的不同而迷惑过，现在在学习 <b>Java</b> 的过程中我也遇见了类似的问题。
</p>

<p>
市面上的 <b>Java</b> 教材使用的 <b>Java</b> 版本各不相同，各个版本之间的语言特性来回切换，让人有点不知所措。
</p>

<p>
这篇博客参考 <a href="https://docs.oracle.com/javase/8/docs/technotes/guides/language/enhancements.html">Java Programming Language Enhancements</a> 整理了一下 <b>Java 5.0 - 8</b> 的功能增强，
希望对有相同困惑的你有所帮助。
</p>
</div>
</div>

<div id="outline-container-org3b40f0f" class="outline-2">
<h2 id="org3b40f0f"><span class="section-number-2">2</span> Java 5.0</h2>
<div class="outline-text-2" id="text-2">
<p>
就目前的情况来说，无论是市面上的 <b>Java</b> 书籍还是实际使用的 <b>Java</b> 版本，大多是 <b>&gt;= 5.0</b> 的，因此，
这一节就只简单介绍一下 <b>5.0</b> 的功能增强。
</p>
</div>

<div id="outline-container-org85321c5" class="outline-3">
<h3 id="org85321c5"><span class="section-number-3">2.1</span> Generics</h3>
<div class="outline-text-3" id="text-2-1">
<p>
熟悉 <b>Java</b> 语言的同学对 <b>泛型</b> 这个特性应该并不陌生，这是一个很常用的特性，单独把这个特性拎出来讲都可以写好几篇博客了。
</p>

<p>
这里就不过多的谈论和泛型相关的内容了，简单举个使用的例子就结束：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">list</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;<span class="org-type">String</span>&gt;();
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f4153a" class="outline-3">
<h3 id="org7f4153a"><span class="section-number-3">2.2</span> Enhanced for Loop</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>for-each</b> 循环是在 <b>5.0</b> 才可以开始使用的，凡是实现了 <code>Iterable</code> 接口的对象或 <b>数组</b> 都可以使用这一循环方式：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">for</span> (<span class="org-type">Type</span> <span class="org-variable-name">item</span> : Iterable or array) {
  ...
}
</pre>
</div>

<p>
但是不得不说，这样的语法形式是真的丑，据说是为了保留 <code>System.in</code> 而没有将 <code>in</code> 作为新的循环关键字。
</p>
</div>
</div>

<div id="outline-container-orgae76752" class="outline-3">
<h3 id="orgae76752"><span class="section-number-3">2.3</span> Autoboxing</h3>
<div class="outline-text-3" id="text-2-3">
<p>
自动装箱这一特性可谓是给编写 Java 代码的程序员带来了极大的便利，但也带来了一下其他的问题，比如：
</p>
<ul class="org-ul">
<li>频繁的装箱拆箱操作带来的性能损失</li>
</ul>

<p>
这可以说是每个 Java 程序员都需要学习的一个问题，也是容易忽视的一个问题。
</p>

<p>
简单的提一下，各个装箱类都有这样形式的两个静态方法： <code>valueOf</code> 和 <code>parseXXX</code>, 合理使用这两个方法可以减少装箱拆箱的次数。
</p>

<p>
比如： <code>Integer.valueOf</code> 返回的是 <code>Integer</code>, 而 <code>Integer.parseInt</code> 返回的是 <code>int</code>.
</p>
</div>
</div>

<div id="outline-container-orgca9f7d3" class="outline-3">
<h3 id="orgca9f7d3"><span class="section-number-3">2.4</span> Typesafe Enums</h3>
<div class="outline-text-3" id="text-2-4">
<p>
在 Java 5.0 以前是没有枚举类型的，要使用枚举只有像这样：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">SEASON_WINTER</span> = 0;
<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">SEASON_SPRING</span> = 1;
<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">SEASON_SUMMER</span> = 2;
<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">SEASON_FALL</span>   = 3;
</pre>
</div>

<p>
这样做会带来一些问题，因此，从 Java 5.0 开始就支持枚举类型了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">enum</span> <span class="org-type">Season</span> { <span class="org-variable-name">WINTER</span>, <span class="org-variable-name">SPRING</span>, <span class="org-variable-name">SUMMER</span>, <span class="org-variable-name">FALL</span> }
</pre>
</div>

<p>
这里有一个很有趣的问题，虽然从 Java 5.0 开始就引入了标准的枚举类型，但是在 <code>Android SDK</code> 的源码中，依然还是在使用 <code>final int</code> 型常量的形式。
</p>

<p>
有兴趣的话可以看看这篇文章了解为什么这么做的原因：<a href="https://android.jlelse.eu/android-performance-avoid-using-enum-on-android-326be0794dc3">Android Performance: Avoid using ENUM on Android – AndroidPub</a>
</p>
</div>
</div>

<div id="outline-container-org2c659ac" class="outline-3">
<h3 id="org2c659ac"><span class="section-number-3">2.5</span> Varargs</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Java 居然是在 5.0 才引入可变参数这一特性的，5.0 以前的 Java 程序员格式化字符串的时候岂不是很辛苦 @_@
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">sum</span>(<span class="org-type">int</span>... <span class="org-variable-name">nums</span>) {
  <span class="org-type">int</span> <span class="org-variable-name">sum</span> = 0;
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">num</span> : nums) {
    sum += num;
  }
  <span class="org-keyword">return</span> sum;
}
</pre>
</div>

<p>
和大多数语言一样，虽然说是可变参数，但实际上就是一个数组。
</p>
</div>
</div>

<div id="outline-container-orgcfee02d" class="outline-3">
<h3 id="orgcfee02d"><span class="section-number-3">2.6</span> Static Import</h3>
<div class="outline-text-3" id="text-2-6">
<p>
静态导入用的好绝得是一大神器，虽然说现代 IDE 的自动补全功能已经很强大，但是，能够少写一些代码还是很好的：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">java</span>.<span class="org-constant">lang</span>.<span class="org-constant">Math</span>.*;

<span class="org-type">double</span> <span class="org-variable-name">r</span> = cos(PI * theta);
</pre>
</div>

<p>
当然了，使用的时候还是应该注意避免污染命名空间。
</p>
</div>
</div>

<div id="outline-container-org9102728" class="outline-3">
<h3 id="org9102728"><span class="section-number-3">2.7</span> Annotations</h3>
<div class="outline-text-3" id="text-2-7">
<p>
注解机制的重要性我想要个不需要我说了，现代的各种 Java 框架，基本上都离不开这一机制的使用。
</p>

<p>
就算不使用这一机制实现什么功能，编写 Java 代码的使用诸如 <b>@Override</b> 的注解还是少不了的。
</p>

<p>
注解一时爽，一直注解一直爽！
</p>
</div>
</div>
</div>

<div id="outline-container-orgeece46a" class="outline-2">
<h2 id="orgeece46a"><span class="section-number-2">3</span> Java SE 6</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
No language changes were introduced in Java SE 6.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org5243bd8" class="outline-2">
<h2 id="org5243bd8"><span class="section-number-2">4</span> Java SE 7</h2>
<div class="outline-text-2" id="text-4">
<p>
我看过的教程还没有哪本用的是 <b>Java 7</b>, 可怜的孩子 @_@
</p>
</div>

<div id="outline-container-org0fda5c2" class="outline-3">
<h3 id="org0fda5c2"><span class="section-number-3">4.1</span> Binary Literals</h3>
<div class="outline-text-3" id="text-4-1">
<p>
二进制整数字面量，也就是说可以用类似 <code>0b1110</code> 或 <code>0B1110</code> 的形式来设置整数值，但是好像是默认为 <code>int</code> 型。
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">An 8-bit 'byte' value:</span>
<span class="org-type">byte</span> <span class="org-variable-name">aByte</span> = (<span class="org-type">byte</span>)0b00100001;

<span class="org-comment-delimiter">// </span><span class="org-comment">A 16-bit 'short' value:</span>
<span class="org-type">short</span> <span class="org-variable-name">aShort</span> = (<span class="org-type">short</span>)0b1010000101000101;

<span class="org-comment-delimiter">// </span><span class="org-comment">Some 32-bit 'int' values:</span>
<span class="org-type">int</span> <span class="org-variable-name">anInt1</span> = 0b10100001010001011010000101000101;
<span class="org-type">int</span> <span class="org-variable-name">anInt2</span> = 0b101;
<span class="org-type">int</span> <span class="org-variable-name">anInt3</span> = 0B101; <span class="org-comment-delimiter">// </span><span class="org-comment">The B can be upper or lower case.</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">A 64-bit 'long' value. Note the "L" suffix:</span>
<span class="org-type">long</span> <span class="org-variable-name">aLong</span> = 0b1010000101000101101000010100010110100001010001011010000101000101L;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e77784" class="outline-3">
<h3 id="org7e77784"><span class="section-number-3">4.2</span> Underscores in Numeric Literals</h3>
<div class="outline-text-3" id="text-4-2">
<p>
数字字面量中间可以有下划线 <code>_</code> 了，在写长整数的使用利用这一特性可以很方便的分清楚现在有几个 <code>0</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">long</span> <span class="org-variable-name">creditCardNumber</span> = 1234_5678_9012_3456L;
<span class="org-type">long</span> <span class="org-variable-name">socialSecurityNumber</span> = 999_99_9999L;
<span class="org-type">float</span> <span class="org-variable-name">pi</span> =      3.14_15F;
<span class="org-type">long</span> <span class="org-variable-name">hexBytes</span> = 0xFF_EC_DE_5E;
<span class="org-type">long</span> <span class="org-variable-name">hexWords</span> = 0xCAFE_BABE;
<span class="org-type">long</span> <span class="org-variable-name">maxLong</span> = 0x7fff_ffff_ffff_ffffL;
<span class="org-type">byte</span> <span class="org-variable-name">nybbles</span> = 0b0010_0101;
<span class="org-type">long</span> <span class="org-variable-name">bytes</span> = 0b11010010_01101001_10010100_10010010;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc4d69" class="outline-3">
<h3 id="org8cc4d69"><span class="section-number-3">4.3</span> Strings in switch Statements</h3>
<div class="outline-text-3" id="text-4-3">
<p>
在 <code>switch</code> 语句的 <code>case</code> 选项中可以使用字符串了，由于看的第一个教材是 <code>Java 5.0</code> 版的，搞得我现在都还不怎么习惯这一特性。
</p>
</div>
</div>

<div id="outline-container-orgc385196" class="outline-3">
<h3 id="orgc385196"><span class="section-number-3">4.4</span> Type Inference for Generic Instance Creation</h3>
<div class="outline-text-3" id="text-4-4">
<p>
类型推断绝对是一个很方便的功能，因为这意味着像下面这样的代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Map</span>&lt;<span class="org-type">String</span>, <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt;&gt; <span class="org-variable-name">myMap</span> = <span class="org-keyword">new</span> <span class="org-type">HashMap</span>&lt;<span class="org-type">String</span>, <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt;&gt;();
</pre>
</div>

<p>
可以写成这样：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Map</span>&lt;<span class="org-type">String</span>, <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt;&gt; <span class="org-variable-name">myMap</span> = <span class="org-keyword">new</span> <span class="org-type">HashMap</span>&lt;&gt;();
</pre>
</div>

<p>
Nice!!!
</p>
</div>
</div>

<div id="outline-container-org7f2900a" class="outline-3">
<h3 id="org7f2900a"><span class="section-number-3">4.5</span> The try-with-resources Statement</h3>
<div class="outline-text-3" id="text-4-5">
<p>
可以说，凡是和 <b>I/O</b> 操作相关的对象，在最后都需要调用 <b>close()</b> 方法，这是一个很繁琐的操作，但不操作还不得行！
</p>

<p>
现在，我们可以这样，让 Java 自动帮你调用 <b>close()</b> 方法：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">static</span> <span class="org-type">String</span> <span class="org-function-name">readFirstLineFromFile</span>(<span class="org-type">String</span> <span class="org-variable-name">path</span>) <span class="org-keyword">throws</span> <span class="org-type">IOException</span> {
  <span class="org-keyword">try</span> (<span class="org-type">BufferedReader</span> <span class="org-variable-name">br</span> = <span class="org-keyword">new</span> <span class="org-type">BufferedReader</span>(<span class="org-keyword">new</span> <span class="org-type">FileReader</span>(path))) {
    <span class="org-keyword">return</span> br.readLine();
  }
}
</pre>
</div>

<p>
凡是实现了 <code>java.lang.AutoCloseable</code> 和 <code>java.io.Closeable</code> 接口的对象，都可以使用这种方式。
</p>
</div>
</div>

<div id="outline-container-org9880b36" class="outline-3">
<h3 id="org9880b36"><span class="section-number-3">4.6</span> Catching Multiple Exception Types and Rethrowing Exceptions with Improved Type Checking</h3>
<div class="outline-text-3" id="text-4-6">
<p>
这里我们主要关注 <b>Catching Multiple Exception Types</b> 这一特性。
</p>

<p>
在编写 <b>Java</b> 代码的过程中，很有可能会遇到需要捕获多个异常但是对这些异常都差不多的情况：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">try</span> {
  ...
} <span class="org-keyword">catch</span> (<span class="org-type">Exception</span> <span class="org-variable-name">e</span>) {
  e.printStackTrace();
}
</pre>
</div>

<p>
有多少个异常就写多少个 <code>catch</code> 块时很繁琐的，因此，从 Java 7 开始，就可以这样：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">catch</span> (IOException | SQLException ex) {
  <span class="org-keyword">throw</span> ex;
}
</pre>
</div>

<p>
通过 <code>|</code> 操作符同时捕获多个类型的异常，很棒，不是吗？
</p>
</div>
</div>
</div>

<div id="outline-container-orgc63e546" class="outline-2">
<h2 id="orgc63e546"><span class="section-number-2">5</span> Java SE 8</h2>
<div class="outline-text-2" id="text-5">
<p>
Java 8 是具有里程碑意义的一个版本，现在我们常用的 Java 版本就是这个版本，成熟的特性，丰富的类库。
</p>
</div>

<div id="outline-container-org5ef3022" class="outline-3">
<h3 id="org5ef3022"><span class="section-number-3">5.1</span> Lambda Expressions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
作为函数式编程和 Lisp 的爱好者，看到 Java 支持 Lambda 表达式的时候心情是激动的，在看到 Java 中 Lambda 的使用后，
就更激动了。
</p>

<p>
除了 Lambda 表达式以外，还新增了方法引用、接口默认方法、Stream 库等新功能。
</p>

<p>
可以说是打造了一个相对完善的函数式编程环境。
</p>

<p>
当然了，Java 本身还是一个 OOP 的语言，但是，能够有地方使用 Lambda 表达式就很爽了。
</p>
</div>
</div>

<div id="outline-container-org1ebd622" class="outline-3">
<h3 id="org1ebd622"><span class="section-number-3">5.2</span> Improved Type Inference</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Java 8 增强了类型推断的功能，具体是什么样的就不多做讨论了，反正，直接用就可以了。
</p>
</div>
</div>

<div id="outline-container-orgab86300" class="outline-3">
<h3 id="orgab86300"><span class="section-number-3">5.3</span> Annotations on Java Types</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Java 8 以前的注解貌似只能用在类和方法上，但是现在可以在 <b>任何地方</b> 使用：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@NonNull</span> <span class="org-type">String</span> <span class="org-variable-name">str</span>;
</pre>
</div>

<p>
这一点对于一些工具来说是很有用的，比如一些 <b>Json</b> 解析库。
</p>
</div>
</div>

<div id="outline-container-orgc1680fe" class="outline-3">
<h3 id="orgc1680fe"><span class="section-number-3">5.4</span> Repeating Annotations</h3>
<div class="outline-text-3" id="text-5-4">
<p>
现在可以在一个地方多出使用相同的注解，就像这样：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@Schedule</span>(dayOfMonth=<span class="org-string">"last"</span>)
<span class="org-c-annotation">@Schedule</span>(dayOfWeek=<span class="org-string">"Fri"</span>, hour=<span class="org-string">"23"</span>)
<span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">doPeriodicCleanup</span>() { ... }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdb6495" class="outline-3">
<h3 id="orgfdb6495"><span class="section-number-3">5.5</span> Method Parameter Reflection</h3>
<div class="outline-text-3" id="text-5-5">
<p>
反射可以获取方法的参数了，在反射面前一个类已经没有多少隐私可言了 @_@
</p>

<p>
还记的前一段时间看到的一个新闻，说以前一些 Android 开发者可以通过反射和 JNI 的方式调用 SDK 中的隐藏接口，
搞得 Google 只能将那些接口变成反射不出来。
</p>

<p>
NB!!!
</p>
</div>
</div>
</div>

<div id="outline-container-org99cdd23" class="outline-2">
<h2 id="org99cdd23"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
其实直接用 Java 8 的话可以不用管那个特性是那个版本开始支持的，直接用就可以了。
</p>

<p>
但是，感觉了解一下相关的内容会有助于 Java 的学习，于是便简单的操作了一下。
</p>

<p>
博客中提到的一些特性只是简单的提了一下它们的名字，而没有说它们具体是怎么样的，如果要了解的话，
可以 Google。
</p>

<p>
还省略了一些内容，有兴趣的可以去看一下官方文档： <a href="https://docs.oracle.com/javase/8/docs/technotes/guides/language/enhancements.html">Java Programming Language Enhancements</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
